Revit 2027 API
FabricationConfiguration.GetAllLoadedItemFiles Method
 Get list of all loaded fabrication item files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFile> GetAllLoadedItemFiles()
Public Function GetAllLoadedItemFiles As IList(Of FabricationItemFile)
public:
IList<FabricationItemFile^>^ GetAllLoadedItemFiles()
member GetAllLoadedItemFiles : unit -> IList<FabricationItemFile>
Return Value
IList<FabricationItemFile>
 Returns an array of the loaded fabrication item files.
Exceptions
Exception | Condition
InvalidOperationException |  The fabrication configuration is not set yet.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace